<?php

use Illuminate\Database\Seeder;

class DsSubjectCourseTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('ds_subject_course')->delete();
        
        \DB::table('ds_subject_course')->insert(array (
            0 => 
            array (
                'id' => 1,
                'subject_id' => 2,
                'course_name' => '倒车入库',
                'pic_cover' => '/uploads/manage/images/170427/15352759019f3fb12ed.png',
                'pic_detail' => '/uploads/manage/images/170420/18340058f88e984d2e2.png',
                'score' => 6,
                'content' => '<p>右倒库:</p><p>1.轻抬离合使车后移，控制好车速，看左后视镜，当右起点感应线出现在左后视镜位置时把转向盘右打死。</p><p>2.把转向盘右打死，继续后移，中间不能停车，同时观察右后视镜，至最右边线露出后，保持车身与库角距离30CM。继续后移，当右后视镜库边线与车身平行时，方向盘回正，调正车身，倒库入底。</p><p>3.倒库入底时看左后视镜，当库前边线出在左后视镜位置时，停车，倒库完成。</p><p>4.出库，挂一档前行，当车前头盖刚看不到路边线时，把转向盘左打死，当车身正时，回正方向，前车轮过左起点感应线，停车。</p><p>左倒库:</p><p>5.轻抬离合使车后移，看左后视镜，当左起点感应线稍微过左后视镜，到位置时把转向盘左打死。</p><p>6.把转向盘左打死，继续后移，同时观察右左视镜，至最左边线露出后，保持车身与库角距离30CM。后移，当左后视镜库边线与车身接近平行时方向盘回正，调正车身，倒库入底。</p><p>7.方向盘回正。看左后视镜，当库前边线出在左后视镜位置时，停车，倒库完成。</p><p>8.出库，挂一档前行，当车前头盖看不到路边线时，把转向盘右打死，当车身正时，回正方向，前车轮过右起点感应线，停车。</p><p><br/></p>',
                'sort_num' => 0,
                'updated_at' => '2017-04-27 15:59:32',
                'created_at' => '2017-03-28 14:07:25',
            ),
            1 => 
            array (
                'id' => 2,
                'subject_id' => 2,
                'course_name' => '侧方停车',
                'pic_cover' => '/uploads/manage/images/170427/15312159019e498fe69.png',
                'pic_detail' => '/uploads/manage/images/170406/10292758e5a807b4d22.jpg',
                'score' => 6,
                'content' => '<p>1.首先在右边起点，半离合状态下把车倒入一个画好的标线内，然后把车开出到左边起点。</p><p>2.然后把车倒入标线，这项的技巧是找参照点，估计你们教练教车的时候给你们应该有做各个地方的参照点，考的时候比如在一个参照点把方向打死，那么如果你害怕有误差那么你宁可早打方向，因为这样在倒的时候你可以通过后视镜来看两边的标线，可以调方向，如果那边的距离小就往哪边稍微打方向调整。</p><p>3.最后迅速回正，切记倒车的时候不能停车，要不就不及格，所以你倒车的时候宁可慢慢的走。</p><p><br/></p>',
                'sort_num' => 4,
                'updated_at' => '2017-04-27 15:31:21',
                'created_at' => '2017-03-28 14:31:52',
            ),
            2 => 
            array (
                'id' => 3,
                'subject_id' => 2,
                'course_name' => '直角转弯',
                'pic_cover' => '/uploads/manage/images/170427/15273559019d6704549.png',
                'pic_detail' => '/uploads/manage/images/170406/10250558e5a701d4937.jpg',
                'score' => 0,
                'content' => '<p>1.首先，调整车体离右侧边线30公分左右的距离，然后直行。</p><p>2.然后当你从左面的后视镜（倒车镜）的下面边缘和车垂直的那条边线重合时，打紧方向盘。</p><p>3.当过了后视镜镜角以后回正正常行驶就可以了。</p><p><br/></p>',
                'sort_num' => 5,
                'updated_at' => '2017-04-27 15:32:17',
                'created_at' => '2017-04-06 10:25:05',
            ),
            3 => 
            array (
                'id' => 4,
                'subject_id' => 2,
                'course_name' => '坡道定点',
                'pic_cover' => '/uploads/manage/images/170427/15321759019e817bfd6.png',
                'pic_detail' => '/uploads/manage/images/170406/10261258e5a74475611.jpg',
                'score' => 0,
            'content' => '<p><span style="color: rgb(0, 0, 0);">温馨提示：在考坡道定点的时候不要太紧张，并且按照自己练习时做的那样就可以通过，主要是放松心态。</span></p><p><br/></p><p>1.平时在的练习时可以尝试把车正好开到里边线的合格处,下车看看线知道合格以后再坐回车里，然后观察你正常驾驶知识以后你的眼和雨刷或者汽车内的某个部件，和边线是怎样一种关系。然后记住。</p><p>2.坡上的那个横着的边线看左后视镜，当你看到边线出现在后视镜的下边缘的时候停车，或者还是和找边线的方法一样，你停上去以后看看距离以后再坐回车里，然后找几个你觉的熟悉的点，记住。</p><p>3.找到点以后就是你按着你找的点练习熟练就可以了。</p><p><br/></p><p><br/></p>',
                'sort_num' => 3,
                'updated_at' => '2017-04-27 15:46:19',
                'created_at' => '2017-04-06 10:26:12',
            ),
            4 => 
            array (
                'id' => 5,
                'subject_id' => 2,
                'course_name' => '曲线行驶',
                'pic_cover' => '/uploads/manage/images/170427/15333059019ecae6f17.png',
                'pic_detail' => '/uploads/manage/images/170406/10270958e5a77d57f39.jpg',
                'score' => 0,
            'content' => '<p><span style="color: rgb(0, 0, 0);">温馨提示：s路线，对整车的行驶把握还是比较重要的</span></p><p><br/></p><p>1.车辆需从S形车道的一端进入后,不压线从另一端开出。当您切入s路线以后，你要尽可能的把握好车速，不要太快，也不能过于缓慢。</p><p>2.沿着s路线凸出去的那个弧趋势行驶，当过了一个弧时，去找下个弧慢慢行驶就可以过的。</p><p>3.速度不要过快，过快的话，稍不留神控制不了车速，你就可能压住周围的边线，导致考试失败，所以要把握好速度，然后找好弧线，跟着线慢慢走就可以的。</p><p><br/></p>',
                'sort_num' => 2,
                'updated_at' => '2017-04-27 15:43:49',
                'created_at' => '2017-04-06 10:27:09',
            ),
            5 => 
            array (
                'id' => 11,
                'subject_id' => 3,
                'course_name' => '上车准备',
                'pic_cover' => '/uploads/manage/images/170406/10345558e5a94f1fba0.jpg',
                'pic_detail' => '/uploads/manage/images/170406/10345558e5a94f1fba0.jpg',
                'score' => 4,
                'content' => '<p>科目三道路驾驶技能考试，主要针对考核人员，在实际道路驾驶时对路况的把握和判断的考核。</p>',
                'sort_num' => 20,
                'updated_at' => '2017-04-27 16:48:36',
                'created_at' => '2017-04-06 10:34:55',
            ),
            6 => 
            array (
                'id' => 12,
                'subject_id' => 3,
                'course_name' => '起步',
                'pic_cover' => '/uploads/manage/images/170328/15450158da147d05ab5.png',
                'pic_detail' => '/uploads/manage/images/170328/15360358da1263eaeba.jpg',
                'score' => 11,
                'content' => '<p>1.训练上车到车辆行走的一系列模拟</p><p>2.错误操作的提示</p><p>3.细节分化，更好的避免因操作规范导致的失误。</p><p>1.脚踏离合器与刹车踏板</p><p>2.即挂一档，并打开左转向灯</p><p>3.喇叭鸣笛示意，看左右后视镜与内置后视镜</p><p>4.松开手刹，抬离合，至半联动状态，抬刹车。</p><p><br/></p>',
                'sort_num' => 0,
                'updated_at' => '2017-04-27 16:32:44',
                'created_at' => '2017-03-28 15:31:17',
            ),
            7 => 
            array (
                'id' => 13,
                'subject_id' => 3,
                'course_name' => '直线行驶',
                'pic_cover' => '/uploads/manage/images/170405/11483958e46917a5b06.png',
                'pic_detail' => '/uploads/manage/images/170405/11483958e46917a5b06.png',
                'score' => 21,
            'content' => '<p><span style="color: rgb(0, 0, 0);">温馨提示：掌握根据道路情况合理控制车速、使用挡位，保持直线行驶，跟车距离适当，行驶过程中适时观察内、外后视镜的驾驶方法。</span></p><p><span style="color: rgb(0, 0, 0);"><br/></span></p><p><span style="color: rgb(0, 0, 0);"></span></p><p>1.选好参照物，注意观察，行驶时驾驶员不仅要目视前方，还要不时注意两旁的情况</p><p>2.握方向盘要正要平稳，在方向盘回正的情况下，方向盘不动差不多就是直线行驶了，所以一定要注意方向盘是否已经回正。</p><p>3.修正方向，注意打方向盘的速度与车速相适应，保持车辆平稳直线进行。</p><p>4.控制车速，通常情况下，不要长期用一个挡位低速行驶，也不要开得过快超过规定的车速要求。</p><p><span style="color: rgb(0, 0, 0);"><br/></span><br/></p>',
                'sort_num' => 0,
                'updated_at' => '2017-04-27 16:39:02',
                'created_at' => '2017-04-05 11:48:39',
            ),
            8 => 
            array (
                'id' => 14,
                'subject_id' => 3,
                'course_name' => '变更车道',
                'pic_cover' => '/uploads/manage/images/170406/10172158e5a5319879c.png',
                'pic_detail' => '/uploads/manage/images/170406/10172158e5a5319879c.png',
                'score' => 10,
            'content' => '<p style="margin-top: 0px; margin-bottom: 0px; color: rgb(51, 51, 51); font-family: "><span style="color: rgb(0, 0, 0);">温馨提示：掌握变更车道时观察、判断车辆安全距离，控制行驶速度，使用灯光信号的驾驶方法。</span></p><p><br/></p><p>1.驾驶人首先要通过内、外后视镜及车窗观察车辆后方、侧方和准备变更的车道上的交通情况。</p><p>2.变更车道之前要发出变更车道行驶信号，如向左侧变更车道，应将左转向灯打开;如向右变更车道，应将右转向灯打开，提醒其他车辆注意。</p><p>3.变更车道时，打方向要快速，幅度不要过大，要沿斜向弧线的方向切入旁边车道。</p><p>4.变更到另一车道的过程要一直保持加速，整个过程需要随时观察前、后、左、右的车辆动态情况。</p><p>5.变更车道后不要减速，继续保持瞬间加速，同时观察前车速度和与前车的距离。观察前车速度，调整车速与前车相当，保持适合的车距即可。</p><p><br/></p>',
                'sort_num' => 0,
                'updated_at' => '2017-04-27 16:40:04',
                'created_at' => '2017-04-06 10:17:21',
            ),
            9 => 
            array (
                'id' => 15,
                'subject_id' => 3,
                'course_name' => '超车',
                'pic_cover' => '/uploads/manage/images/170410/11340058eafd28ce4ee.jpg',
                'pic_detail' => '/uploads/manage/images/170410/11340058eafd28ce4ee.png',
                'score' => 8,
            'content' => '<p><span style="color: rgb(0, 0, 0);">温馨提示：掌握同向超车、借道超车的要领，以及观察被超越车辆的动态，保持与被超越车辆的安全间距，观察左侧交通情况，选择合理超车时机的驾驶方法。</span></p><p><br/></p><p>1.超车前不仅要观察前方和左侧的交通情况，还要通过内、外后视镜观察后方的交通情况。超车时应侧头观察被超越车辆的动态。</p><p>2.在没有中心线或同方向只有一条行车道的道路上不能从右侧超车。</p><p>3.超车需要两次使用转向灯：一次是在超车前，当车辆准备向左变更车道时，打开左转向灯;另一次是超越前车后，车辆准备回归原车道，此时应打开右转向灯。</p><p>4.超车时，有的驾驶人往往只注意一侧的间距而忽视另一侧的间距，这种顾此失彼的现象会造成擦剐或翻车事故。超车时掌握横向距离并要左右兼顾，准确估计，同时掌握方向，注意车速，尽量减少汽车的横向震摆，以利安全超车。</p><p><br/></p>',
                'sort_num' => 0,
                'updated_at' => '2017-04-27 16:44:09',
                'created_at' => '2017-04-06 10:32:44',
            ),
            10 => 
            array (
                'id' => 16,
                'subject_id' => 3,
                'course_name' => '行驶注意',
                'pic_cover' => '/uploads/manage/images/170406/10340558e5a91d36c94.jpg',
                'pic_detail' => '/uploads/manage/images/170406/10340558e5a91d36c94.jpg',
                'score' => 8,
            'content' => '<p><span style="color: rgb(0, 0, 0);">温馨提示：掌握安全通过人行横道、合理控制车速、礼让行人的驾驶方法。安全通过学校区域，文明礼让，避让学生和校车，确保安全通过的驾驶方法。通过公共汽车站提前减速，观察公共汽车进、出站动态和上下车乘客动态及预防行人横穿道路的驾驶方法。</span></p><p><br/></p><p>行驶中针对学校、公共汽车站、人行横道</p><p>1.注意观察左右，并减速进入该区域车速低于30km/h。</p><p>2.人行横道有行人通过时需停车让行。</p><p>3.公共汽车站，在超越公共汽车时，注意提防公共汽车起步后突然向左转向或上、下车的乘客从车前、后突然横穿道路，保持较大的安全间距进行超越，并随时做好停车避让的准备。</p><p><br/></p>',
                'sort_num' => 0,
                'updated_at' => '2017-04-27 17:17:38',
                'created_at' => '2017-04-06 10:34:05',
            ),
            11 => 
            array (
                'id' => 17,
                'subject_id' => 3,
                'course_name' => '掉头',
                'pic_cover' => '/uploads/manage/images/170406/10331358e5a8e9810d8.jpg',
                'pic_detail' => '/uploads/manage/images/170406/10331358e5a8e9810d8.jpg',
                'score' => 8,
            'content' => '<p><span style="color: rgb(0, 0, 0);">温馨提示：掌握降低车速，观察交通情况，正确选择掉头地点和时机的驾驶方法。</span></p><p><br/></p><p>1.打开左转向灯。</p><p>2.观察后方来车情况，确保安全，在开灯三秒后，左打方向，平稳进入内车道。</p><p>3.若左转向灯自动复位后，要迅速再次打开左转向灯。</p><p>4.三档前行至距掉头处30米远时，踩刹车(车速降至20码)，换二档，再踩刹车(车速降至15码)，换一档。</p><p>5.观察周围情况，确保安全，迅速掉头。进入行车道。(当遇行车道有来车时，可进入超车道，之后再变回行车道)</p><p>6.掉头完成后，迅速加油门，换高速档。</p><p><br/></p>',
                'sort_num' => 0,
                'updated_at' => '2017-04-27 16:45:11',
                'created_at' => '2017-04-06 10:33:13',
            ),
            12 => 
            array (
                'id' => 18,
                'subject_id' => 3,
                'course_name' => '靠边停车',
                'pic_cover' => '/uploads/manage/images/170406/10333858e5a902c0657.jpg',
                'pic_detail' => '/uploads/manage/images/170406/10333858e5a902c0657.jpg',
                'score' => 8,
            'content' => '<p><span style="color: rgb(0, 0, 0);">温馨提示：掌握靠路边顺位停车、倒入路边车位（S形倒车入位）、倒入车库（L形倒车入位）的操作方法。</span></p><p><br/></p><p>1.打右转向灯。</p><p>2.踩刹车降速。</p><p>3.向右打方向盘，尽有可能使车接近路缘，在这以后回方向盘。</p><p>4.踩分离器，踩刹车。</p><p>5.拉手动刹车，挂空挡，松分离器，松刹车，关掉转向灯。</p><p><br/></p>',
                'sort_num' => 0,
                'updated_at' => '2017-04-27 17:16:59',
                'created_at' => '2017-04-06 10:33:38',
            ),
            13 => 
            array (
                'id' => 19,
                'subject_id' => 3,
                'course_name' => '通过路口',
                'pic_cover' => '/uploads/manage/images/170406/10310758e5a86ba4805.jpg',
                'pic_detail' => '/uploads/manage/images/170406/10310758e5a86ba4805.jpg',
                'score' => 5,
            'content' => '<p><span style="color: rgb(0, 0, 0);">温馨提示：掌握路口合理观察交通情况，减速或停车瞭望，直行安全通过路口的驾驶方法；掌握路口合理观察交通情况，减速或停车瞭望，正确使用转向灯，左、右转弯安全通过路口的驾驶方法。</span></p><p><br/></p><p>1.红灯，红灯亮时，驾驶员要将车停在停止线以内，拉手制动或将右脚一直放在制动踏板上， 等待交通灯的变化。</p><p>2.黄灯，黄灯亮时，禁止通行，已经越过停车线的车辆可以继续通过。</p><p>3.绿灯，绿灯亮时，如果是停在路口的首车，要先确认左右安全后再起步行驶。</p><p>4.在路口处应让车减速、观察路口的情况、再通过路口。</p><p>5.不抢黄灯，车速50km/h以下。</p><p><br/></p>',
                'sort_num' => 0,
                'updated_at' => '2017-04-27 16:41:22',
                'created_at' => '2017-04-06 10:31:07',
            ),
            14 => 
            array (
                'id' => 20,
                'subject_id' => 3,
                'course_name' => '会车',
                'pic_cover' => '/uploads/manage/images/170406/10315858e5a89e00bd5.jpg',
                'pic_detail' => '/uploads/manage/images/170406/10315858e5a89e00bd5.jpg',
                'score' => 8,
            'content' => '<p><span style="color: rgb(0, 0, 0);">温馨提示：掌握正确判断会车地点，会车有危险时，控制车速、提前避让、调整会车地点及与对方车辆保持安全间距的驾驶方法。</span></p><p><br/></p><p>1.减速靠右行驶，并与其他车辆、行人保持必要的安全距离。</p><p>2.在有障碍的路段，无障碍的一方先行，但有障碍的一方已驶入障碍路段而无障碍的一方未驶入时，有障碍的一方先行;三是在狭窄的坡路，上坡的一方先行，但下坡的一方已行至中途而上坡的一方未上坡时，下坡的一方先行;四是在狭窄的山路，不靠山体的一方先行;五是夜间会车应当在距相对方向来车150米以外改用近光灯，在窄路、窄桥与非机动车会车时应当使用近光灯。</p><p>3.会车后，确认对方车后视线盲区内无横行的非机动车和行人，前方无连续交会的车辆，向左变更行车路线。</p><p><br/></p>',
                'sort_num' => 0,
                'updated_at' => '2017-04-27 16:42:01',
                'created_at' => '2017-04-06 10:31:58',
            ),
            15 => 
            array (
                'id' => 21,
                'subject_id' => 3,
                'course_name' => '夜间行车',
                'pic_cover' => '/uploads/manage/images/170406/10352058e5a96871e2d.jpg',
                'pic_detail' => '/uploads/manage/images/170406/10352058e5a96871e2d.jpg',
                'score' => 5,
            'content' => '<p><span style="color: rgb(0, 0, 0);">温馨提示：掌握夜间起步、会车、超车、通过急弯、通过坡路、通过拱桥、通过人行横道或者没有交通信号灯控制的路口时正确使用灯光的驾驶方法。</span></p><p><br/></p><p>1.夜间在没有路灯，照明不良条件下行驶开示宽灯、远光灯</p><p>2.请将前照灯变换成远光开远光灯</p><p>3.夜间在窄路、窄桥与非机动车会车开近光灯</p><p>4.夜间同方向近距离跟车行驶开近光灯</p><p>5.夜间在道路上发生故障妨碍交通又难以移动关大灯 开示宽灯和危险报警闪光灯</p><p>6.雾天行驶开前照灯 前后雾灯 危险报警闪光灯</p><p>7.夜间与机动车会车开近光灯</p><p>8.夜间通过没有交通信号灯控制的路口远近光灯交替闪灯两次</p><p>9.夜间通过拱桥、人行横道远近光灯交替闪灯两次</p><p>10.夜间通过急弯、坡路远近光灯交替闪灯两次</p><p><br/></p>',
                'sort_num' => 0,
                'updated_at' => '2017-04-27 17:19:28',
                'created_at' => '2017-04-06 10:35:20',
            ),
        ));
        
        
    }
}
